In [1]:
import pandas as pd

In [2]:
a= pd.Series(data=[100,200,300,400,500], index=['johnson', 'emma', 'osita', 'amaka', 'esther'])

In [3]:
a

johnson    100
emma       200
osita      300
amaka      400
esther     500
dtype: int64

In [4]:
a.index

Index(['johnson', 'emma', 'osita', 'amaka', 'esther'], dtype='object')

In [5]:
a[['emma']]

emma    200
dtype: int64

In [6]:
d = {'first': pd.Series([100.,200.,300.,400.,500], index=['ball','cat', 'dog','goat','yam']),
  'second': pd.Series([600.,700.,800., 900.], index=['ball','cat', 'dog','goat'])}

In [7]:
df=pd.DataFrame(d)
print(df)

      first  second
ball  100.0   600.0
cat   200.0   700.0
dog   300.0   800.0
goat  400.0   900.0
yam   500.0     NaN

In [8]:
pd.DataFrame(d, index=['cat', 'dog'])

     first  second
cat  200.0   700.0
dog  300.0   800.0

In [9]:
k=pd.DataFrame(d, columns=['first'], index=['cat'])
print(k)

     first
cat  200.0

In [10]:
df.loc['cat']['first']=666
print(df)

      first  second
ball  100.0   600.0
cat   666.0   700.0
dog   300.0   800.0
goat  400.0   900.0
yam   500.0     NaN

In [11]:
df['third']= df['first']*df['second']
df

      first  second     third
ball  100.0   600.0   60000.0
cat   666.0   700.0  466200.0
dog   300.0   800.0  240000.0
goat  400.0   900.0  360000.0
yam   500.0     NaN       NaN

In [12]:
df['flag']=df['first']>100
df

      first  second     third   flag
ball  100.0   600.0   60000.0  False
cat   666.0   700.0  466200.0   True
dog   300.0   800.0  240000.0   True
goat  400.0   900.0  360000.0   True
yam   500.0     NaN       NaN   True

In [13]:
three=df.pop('third')
three

ball     60000.0
cat     466200.0
dog     240000.0
goat    360000.0
yam          NaN
Name: third, dtype: float64

In [14]:
df

      first  second   flag
ball  100.0   600.0  False
cat   666.0   700.0   True
dog   300.0   800.0   True
goat  400.0   900.0   True
yam   500.0     NaN   True

In [15]:
del df['second']

In [16]:
df

      first   flag
ball  100.0  False
cat   666.0   True
dog   300.0   True
goat  400.0   True
yam   500.0   True

In [17]:
df.insert(1,'baddest',df['first'][1:])

In [18]:
df

      first  baddest   flag
ball  100.0      NaN  False
cat   666.0    666.0   True
dog   300.0    300.0   True
goat  400.0    400.0   True
yam   500.0    500.0   True

In [19]:
df['baddo']=df['baddest'][:3]
df

      first  baddest   flag  baddo
ball  100.0      NaN  False    NaN
cat   666.0    666.0   True  666.0
dog   300.0    300.0   True  300.0
goat  400.0    400.0   True    NaN
yam   500.0    500.0   True    NaN

*Data frame using python dictionaries*

In [20]:
A=[{'apple':10 ,'ball':20 , 'cow':30}, {'boy':50, 'girl':60, 'man':70 , 'baby':80}]
z=pd.DataFrame(A, index=['green', 'blue'])
z

       apple  ball   cow   boy  girl   man  baby
green   10.0  20.0  30.0   NaN   NaN   NaN   NaN
blue     NaN   NaN   NaN  50.0  60.0  70.0  80.0

In [21]:
z['apple']['blue']=100
z

       apple  ball   cow   boy  girl   man  baby
green   10.0  20.0  30.0   NaN   NaN   NaN   NaN
blue   100.0   NaN   NaN  50.0  60.0  70.0  80.0